gpu-vllm-mi300x-2b/benchmarks/runs/2026-09-18-vllm-sweep-mi300x-v0191-bf16/c8-in128-out512.rep1.log
INFO 09-18 18:04:37 [importing.py:44] Triton is installed but 0 active driver(s) found (expected 1). Disabling Triton to prevent runtime errors.
INFO 09-18 18:04:37 [importing.py:68] Triton not installed or not compatible; certain GPU-related functions will not be available.
INFO 09-18 18:04:41 [main.py:49] Unspecified platform detected, switching to CPU Platform instead.
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7fe41a7da840>, trust_remote_code=False, seed=5200, num_prompts=16, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=128, random_output_len=512, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='vllm', base_url='http://127.0.0.1:8000', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=8, model='google/gemma-4-E2B-it', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=None, result_dir='/dev/shm', result_filename='vllm-bench-1d772a94.json', ignore_eos=True, percentile_metrics='ttft,tpot,itl', metric_percentiles='90,99', goodput=None, request_id_prefix='bench-0b2fd323-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds=[25.0, 50.0], plot_dataset_stats=False)
INFO 09-18 18:04:43 [datasets.py:700] Sampling input_len from [128, 128] and output_len from [512, 512]
WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 8
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     16        
Failed requests:                         0         
Maximum request concurrency:             8         
Benchmark duration (s):                  7.52      
Total input tokens:                      2048      
Total generated tokens:                  8192      
Request throughput (req/s):              2.13      
Output token throughput (tok/s):         1089.34   
Peak output token throughput (tok/s):    1696.00   
Peak concurrent requests:                16.00     
Total token throughput (tok/s):          1361.68   
---------------Time to First Token----------------
Mean TTFT (ms):                          1259.57   
Median TTFT (ms):                        1259.07   
P90 TTFT (ms):                           2476.14   
P99 TTFT (ms):                           2476.53   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          4.89      
Median TPOT (ms):                        4.89      
P90 TPOT (ms):                           5.07      
P99 TPOT (ms):                           5.07      
---------------Inter-token Latency----------------
Mean ITL (ms):                           4.89      
Median ITL (ms):                         4.73      
P90 ITL (ms):                            4.84      
P99 ITL (ms):                            5.01      
==================================================